# Core Exception (transversal a nivel de todo el proyecto)
common.exception.error.historical.entity.notfound=Error al invocar el servicio hist\u00F3rico para la entidad\: {0}
common.exception.error.enum.message.notfound=No se encontr\u00F3 el mensaje para la clave\: {0}
common.exception.entity.noexists=La entidad solicitada no existe o ha sido eliminada.
common.exception.error.general=Se produjo un error inesperado. Por favor contacte a soporte.

# SECURITY EXCEPTION
functional.user.create.email.unique=El correo electr\u00F3nico ingresado ya est\u00E1 registrado en el sistema.
functional.user.create.nofound=El servicio solicitado no pudo ser encontrado. Por favor, verifica los detalles e intenta nuevamente.
functional.user.id.notfound=El usuario con id {0} no existe en el sistema.
functional.user.email.exists=La direcci\u00F3n de correo electr\u00F3nico ya existe en el sistema.
functional.person.notfound=La persona con id {0} no existe en el sistema.
functional.user.username.notfound=El usuario {0} no existe en el sistema.

# USER STATE
user.state.active=Usuario activo
user.state.disabled=Usuario deshabilitado
user.state.incompleteperfil=Perfil de usuario icompleto

# CRUD USER
user.creation.exit=Usuario creado: {0}, {1}

# CRUD PERSON
firstname=Primer nombre
middlename=Segundo nombre
lastName=Primer Apellido
middlelastname=Segundo Apellido

functional.roleuser.not.exist= La entidad sec_role_user para el usuario {0} no existe in el sistema.
role.security.systemadmin=Administrador del Sistema - Tiene control total sobre el sistema, incluida la gesti\u00F3n de usuarios y configuraciones. Reservado para un n\u00FAmero limitado de usuarios.
role.security.securityadmin=Administrador de Seguridad - Gestiona roles, permisos y pol\u00EDticas de seguridad. No tiene acceso a datos operativos.
role.security.appadmin=Administrador de la Aplicaci\u00F3n - Responsable de la gesti\u00F3n de las funcionalidades de la aplicaci\u00F3n, sin acceso a configuraciones de seguridad.
role.security.auditor=Auditor - Acceso de solo lectura para monitorear y auditar actividades del sistema con fines de cumplimiento y seguridad.
role.security.user=Usuario Regular - Rol est\u00E1ndar con acceso a funcionalidades b\u00E1sicas de la aplicaci\u00F3n seg\u00FAn los permisos asignados.
role.security.newuser=Nuevo Usuario - Rol temporal asignado a usuarios reci\u00E9n registrados, permitiendo crear su perfil y realizar la configuraci\u00F3n inicial.

# Permisos para entidades
permission.create.entity=Permite crear una entidad
permission.view.entity=Permite ver una entidad
permission.update.entity=Permite actualizar una entidad
permission.delete.entity=Permite eliminar una entidad
# Permisos para usuarios
permission.create.user=Permite crear un perfil de usuario
permission.view.user=Permite ver el propio perfil de usuario
permission.delete.user=Permite eliminar el propio perfil de usuario
permission.update.user=Permite actualizar el propio perfil de usuario

# Mensajes de validación: PersonDTO
validation.person.iduser.notnull=El ID de usuario no puede ser nulo.
validation.person.iduser.notfound=El usuario no existe en la base de datos.
validation.person.firstname.notnull=El primer nombre no puede ser nulo.
validation.person.lastname.notnull=El apellido no puede ser nulo.

validation.person.firstname.invalid=El nombre es inv\u00E1lido. Debe contener solo letras (m\u00E1x. 30 caracteres).
validation.person.lastname.invalid=El apellido es inv\u00E1lido. Debe contener solo letras (m\u00E1x. 30 caracteres).
validation.person.phonenumber.invalid=El n\u00FAmero de tel\u00E9fono es inv\u00E1lido. Debe contener solo d\u00EDgitos y puede incluir un c\u00F3digo de pa\u00EDs.
validation.person.date.invalid=La fecha es inv\u00E1lida.
validation.person.numeric.invalid=El valor debe contener solo caracteres num\u00E9ricos.
validation.person.alphanumeric.invalid=El valor debe contener solo caracteres alfanum\u00E9ricos.
validation.person.url.invalid=La URL es inv\u00E1lida. Proporcione una URL v\u00E1lida.
validation.person.date.invalidformat=El formato de la fecha es inv\u00E1lido. Use el formato ISO-8601 (ej., 2025-01-01T12\:00\:00).
validation.address.notnull=La direcci\u00F3n no puede ser nula.
validation.address.invalidformat=El formato de la direcci\u00F3n es inv\u00E1lido. Use un formato colombiano v\u00E1lido (ej., Carrera 12 \#34-204).
functional.person.exist=La persona ya se encuentra registrada en el sistema.
functional.person.iduser.notassociate=El usuario no est\u00E1 asociado a la sesi\u00F3n.
functional.person.iduser.isassociate=El usuario ya ha diligenciado su informaci\u00F3n personal, existe un registro para la persona.

# Mensajes de validación: UserDTO
validation.user.username.invalid=El nombre de usuario s\u00F3lo puede contener letras, n\u00FAmeros, puntos (.), guiones bajos (_) y guiones medios (-). La longitud m\u00E1xima es de 30 caracteres.
validation.user.password.invalid=La contrase\u00F1a es inv\u00E1lida. Debe tener al menos 8 y m\u00E1ximio 64 caracteres, incluyendo una letra, un n\u00FAmero y un car\u00E1cter especial.
validation.user.email.invalid=El correo electr\u00F3nico es inv\u00E1lido. Utilice un formato v\u00E1lido (ej., usuario@ejemplo.com).
validation.user.email.notnull=El correo electr\u00F3nico no puede ser nulo.
validation.user.username.notnull=El nombre de usuario no puede ser nulo.
validation.user.password.notnull=La contrase\u00F1a no puede ser nula.
validation.user.username.maxlength=El nombre de usuario no puede exceder los 30 caracteres.
functional.user.exist=El usuario ya se encuentra registrado en el sistema.

# Auth
auth.logout.succes=Sesi\u00F3n cerrada exitosamente.
auth.token.invalid=Token inv\u00E1lido
auth.uri.forbiden=No tiene permisos para acceder a esta ruta

# Mensajes de validación: RoleDTO
validation.role.name.invalid=El nombre del rol {0} no es v\u00E1lido. Debe contener solo letras may\u00FAsculas y estar separado por guiones bajos (_).
validation.role.name.invalid.maxlength=El nombre del rol {0} excede la longitud m\u00E1xima permitida de 100 caracteres.
validation.role.name.notnull=El nombre del rol es obligatorio y no puede estar vac\u00EDo.
validation.role.description.notnull=La descripci\u00F3n del rol es obligatoria y no puede estar vac\u00EDa.
validation.role.description.maxlength=La descripci\u00F3n del rol excede la longitud m\u00E1xima permitida de 255 caracteres.
common.exception.rol.noexists=El role {0} no existe.
functional.role.exist=El role {0} ya existe.
functional.exception.rol.nodelete=No se puede eliminar el rol seleccionado. Existen registros relacionados que impiden su eliminaci\u00F3n. Verifique las dependencias antes de intentar nuevamente.
functional.exception.role.assignment.exists=El permiso {0} ya se encuentra asignado al rol {1}.
functional.exception.role.assignment.notexists=El permiso {0} no se encuentra asignado al rol {1}.

# Mensajes de validación: PermissionDTO:
validation.permission.name.invalid=El nombre del permiso es inv\u00E1lido. Debe contener solo caracteres alfanum\u00E9ricos y no puede tener caracteres especiales.
validation.permission.name.invalid.maxlength=El nombre del permiso excede la longitud m\u00E1xima de 100 caracteres.
validation.permission.name.notnull=El nombre del permiso es obligatorio y no puede estar vac\u00EDo.
validation.permission.description.invalid.maxlength=La descripci\u00F3n del permiso excede la longitud m\u00E1xima de 255 caracteres.
validation.permission.description.notnull=La descripci\u00F3n del permiso es obligatoria y no puede estar vac\u00EDa.
validation.permission.resource.invalid=La ruta proporcionada no es v\u00E1lida. Aseg\u00FArese de que siga el formato correcto\: debe comenzar con '/api/v1/', utilizar solo letras min\u00FAsculas y n\u00FAmeros, y los par\u00E1metros deben estar entre llaves (por ejemplo, '/api/v1/person/{id}').
validation.permission.resource.invalid.maxlength=El recurso del permiso excede la longitud m\u00E1xima de 200 caracteres.
validation.permission.resource.notnul=El recurso del permiso es obligatorio y no puede estar vac\u00EDo.
validation.permission.method.invalid=El m\u00E9todo del permiso es inv\u00E1lido. Solo se permiten valores como 'GET', 'POST', 'PUT', 'DELETE'.
validation.permission.method.invalid.maxlength=El m\u00E9todo del permiso excede la longitud m\u00E1xima de 20 caracteres.
validation.permission.method.notnull=El m\u00E9todo del permiso es obligatorio y no puede estar vac\u00EDo.
validation.permission.operation.invalid=La operaci\u00F3n del permiso es inv\u00E1lida. Debe ser una de las siguientes\: 'CREATE', 'UPDATE', 'DELETE', 'GET', 'LIST'.
validation.permission.operation.invalid.maxlength=La operaci\u00F3n del permiso excede la longitud m\u00E1xima de 50 caracteres.
validation.permission.operation.notnull=La operaci\u00F3n del permiso es obligatoria y no puede estar vac\u00EDa.
functional.permission.exist=El permiso {0} ya existe.
functional.permission.noexists=El permiso {0} no existe.
functional.permission.notdelete=No se puede eliminar el permiso seleccionado. Existen registros relacionados que impiden su eliminaci\u00F3n. Verifique las dependencias antes de intentar nuevamente.

# Mensajes para el token de verificación
functional.verification.token.expiration=El token de verificaci\u00F3n ha expirado.
functional.verification.token.notfound=El token de verificaci\u00F3n no se encontr\u00F3.
verification.token.email.subject=C\u00F3digo de Verificaci\u00F3n de ZenWk\: {0}
functional.verification.token.email.notmatch=El c\u00F3digo ingresado existe, pero el correo no coincide
functional.verification.token.uuid.notmatch=El c\u00F3digo UUID no coincide. 
functional.verification.token.uuid.notfound=El c\u00F3digo UUID no existe.

